circular-cylinder-Re100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          170;
        startFace       77150;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          170;
        startFace       77320;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       77490;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       77690;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       77890;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          77600;
        startFace       78050;
    }
)

// ************************************************************************* //
